jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
/* Routed pin properties */
#define BOARD_INITPINS_GPIO_debug_PERIPHERAL                               GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_GPIO_debug_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_GPIO_debug_CHANNEL                                    19U   /*!< Signal channel */
#define BOARD_INITPINS_GPIO_debug_PIN_NAME                         GPIO_AD_B1_03   /*!< Routed pin name */
#define BOARD_INITPINS_GPIO_debug_LABEL                        "SPDIF_IN/J22[8]"   /*!< Label */
#define BOARD_INITPINS_GPIO_debug_NAME                              "GPIO_debug"   /*!< Identifier */
#define BOARD_INITPINS_GPIO_debug_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GPIO_debug_GPIO                                     GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO_debug_INIT_GPIO_VALUE                             0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_GPIO_debug_GPIO_PIN                                   19U   /*!< GPIO pin number */
#define BOARD_INITPINS_GPIO_debug_GPIO_PIN_MASK                      (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_GPIO_debug_PORT                                     GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_debug_PIN                                        19U   /*!< PORT pin number */
#define BOARD_INITPINS_GPIO_debug_PIN_MASK                           (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B0_09 (coord F14), LED_1 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_led_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_USER_led_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_led_CHANNEL                                       9U   /*!< Signal channel */
#define BOARD_INITPINS_USER_led_PIN_NAME                           GPIO_AD_B0_09   /*!< Routed pin name */
#define BOARD_INITPINS_USER_led_LABEL                                    "LED_1"   /*!< Label */
#define BOARD_INITPINS_USER_led_NAME                                  "USER_led"   /*!< Identifier */
#define BOARD_INITPINS_USER_led_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_led_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_led_INIT_GPIO_VALUE                               0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_USER_led_GPIO_PIN                                      9U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_led_GPIO_PIN_MASK                         (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USER_led_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USER_led_PIN                                           9U   /*!< PORT pin number */
#define BOARD_INITPINS_USER_led_PIN_MASK                              (1U << 9U)   /*!< PORT pin mask */

/* WAKEUP (coord L6), GPIO_int */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON_PERIPHERAL                              GPIO5   /*!< Peripheral name */
#define BOARD_INITPINS_USER_BUTTON_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_BUTTON_CHANNEL                                    0U   /*!< Signal channel */
#define BOARD_INITPINS_USER_BUTTON_PIN_NAME                               WAKEUP   /*!< Routed pin name */
#define BOARD_INITPINS_USER_BUTTON_LABEL                              "GPIO_int"   /*!< Label */
#define BOARD_INITPINS_USER_BUTTON_NAME                            "USER_BUTTON"   /*!< Identifier */
#define BOARD_INITPINS_USER_BUTTON_DIRECTION             kPIN_MUX_DirectionInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_BUTTON_GPIO                                    GPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON_GPIO_PIN                                   0U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_BUTTON_GPIO_PIN_MASK                      (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USER_BUTTON_PORT                                    GPIO5   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON_PIN                                        0U   /*!< PORT pin number */
#define BOARD_INITPINS_USER_BUTTON_PIN_MASK                           (1U << 0U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PERIPHERAL                    LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_SIGNAL                             TX   /*!< Signal name */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PIN_NAME                GPIO_AD_B0_12   /*!< Routed pin name */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_LABEL                     "UART1_TXD"   /*!< Label */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_NAME                      "UART1_TXD"   /*!< Identifier */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PERIPHERAL                    LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_SIGNAL                             RX   /*!< Signal name */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PIN_NAME                GPIO_AD_B0_13   /*!< Routed pin name */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_LABEL                     "UART1_RXD"   /*!< Label */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_NAME                      "UART1_RXD"   /*!< Identifier */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

