jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_EMC_09 (coord C2), SEMC_A0 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A0_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A0_CHANNEL                                   0U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A0_PIN_NAME                         GPIO_EMC_09   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A0_LABEL                              "SEMC_A0"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A0_NAME                               "SEMC_A0"   /*!< Identifier */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A1_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A1_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A1_CHANNEL                                   1U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A1_PIN_NAME                         GPIO_EMC_10   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A1_LABEL                              "SEMC_A1"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A1_NAME                               "SEMC_A1"   /*!< Identifier */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A2_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A2_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A2_CHANNEL                                   2U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A2_PIN_NAME                         GPIO_EMC_11   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A2_LABEL                              "SEMC_A2"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A2_NAME                               "SEMC_A2"   /*!< Identifier */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A3_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A3_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A3_CHANNEL                                   3U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A3_PIN_NAME                         GPIO_EMC_12   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A3_LABEL                              "SEMC_A3"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A3_NAME                               "SEMC_A3"   /*!< Identifier */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A4_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A4_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A4_CHANNEL                                   4U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A4_PIN_NAME                         GPIO_EMC_13   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A4_LABEL                              "SEMC_A4"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A4_NAME                               "SEMC_A4"   /*!< Identifier */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A5_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A5_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A5_CHANNEL                                   5U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A5_PIN_NAME                         GPIO_EMC_14   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A5_LABEL                              "SEMC_A5"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A5_NAME                               "SEMC_A5"   /*!< Identifier */

/* GPIO_EMC_15 (coord B1), SEMC_A6 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A6_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A6_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A6_CHANNEL                                   6U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A6_PIN_NAME                         GPIO_EMC_15   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A6_LABEL                              "SEMC_A6"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A6_NAME                               "SEMC_A6"   /*!< Identifier */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A7_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A7_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A7_CHANNEL                                   7U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A7_PIN_NAME                         GPIO_EMC_16   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A7_LABEL                              "SEMC_A7"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A7_NAME                               "SEMC_A7"   /*!< Identifier */

/* GPIO_EMC_17 (coord A4), SEMC_A8 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A8_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A8_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A8_CHANNEL                                   8U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A8_PIN_NAME                         GPIO_EMC_17   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A8_LABEL                              "SEMC_A8"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A8_NAME                               "SEMC_A8"   /*!< Identifier */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A9_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A9_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A9_CHANNEL                                   9U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A9_PIN_NAME                         GPIO_EMC_18   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A9_LABEL                              "SEMC_A9"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A9_NAME                               "SEMC_A9"   /*!< Identifier */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A10_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A10_SIGNAL                                 ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A10_CHANNEL                                 10U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A10_PIN_NAME                        GPIO_EMC_23   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A10_LABEL                            "SEMC_A10"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A10_NAME                             "SEMC_A10"   /*!< Identifier */

