jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_EMC_19 (coord B4), SEMC_A11 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A11_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A11_SIGNAL                                 ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A11_CHANNEL                                 11U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A11_PIN_NAME                        GPIO_EMC_19   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A11_LABEL                            "SEMC_A11"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A11_NAME                             "SEMC_A11"   /*!< Identifier */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A12_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A12_SIGNAL                                 ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A12_CHANNEL                                 12U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_A12_PIN_NAME                        GPIO_EMC_20   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_A12_LABEL                            "SEMC_A12"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A12_NAME                             "SEMC_A12"   /*!< Identifier */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_BA0_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_SIGNAL                                   BA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_CHANNEL                                  0U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_BA0_PIN_NAME                        GPIO_EMC_21   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_BA0_LABEL                            "SEMC_BA0"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_BA0_NAME                             "SEMC_BA0"   /*!< Identifier */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_BA1_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_SIGNAL                                   BA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_CHANNEL                                  1U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_BA1_PIN_NAME                        GPIO_EMC_22   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_BA1_LABEL                            "SEMC_BA1"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_BA1_NAME                             "SEMC_BA1"   /*!< Identifier */

/* GPIO_EMC_24 (coord D3), SEMC_CAS */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CAS_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CAS_SIGNAL                             semc_cas   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_CAS_PIN_NAME                        GPIO_EMC_24   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_CAS_LABEL                            "SEMC_CAS"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_CAS_NAME                             "SEMC_CAS"   /*!< Identifier */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CKE_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CKE_SIGNAL                             semc_cke   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_CKE_PIN_NAME                        GPIO_EMC_27   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_CKE_LABEL                            "SEMC_CKE"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_CKE_NAME                             "SEMC_CKE"   /*!< Identifier */

/* GPIO_EMC_26 (coord B3), SEMC_CLK */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_CLK_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_CLK_SIGNAL                             semc_clk   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_CLK_PIN_NAME                        GPIO_EMC_26   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_CLK_LABEL                            "SEMC_CLK"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_CLK_NAME                             "SEMC_CLK"   /*!< Identifier */

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D0_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D0_CHANNEL                                   0U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D0_PIN_NAME                         GPIO_EMC_00   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D0_LABEL                              "SEMC_D0"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D0_NAME                               "SEMC_D0"   /*!< Identifier */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D1_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D1_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D1_CHANNEL                                   1U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D1_PIN_NAME                         GPIO_EMC_01   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D1_LABEL                              "SEMC_D1"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D1_NAME                               "SEMC_D1"   /*!< Identifier */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D2_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D2_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D2_CHANNEL                                   2U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D2_PIN_NAME                         GPIO_EMC_02   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D2_LABEL                              "SEMC_D2"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D2_NAME                               "SEMC_D2"   /*!< Identifier */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D3_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D3_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D3_CHANNEL                                   3U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D3_PIN_NAME                         GPIO_EMC_03   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D3_LABEL                              "SEMC_D3"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D3_NAME                               "SEMC_D3"   /*!< Identifier */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D4_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D4_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D4_CHANNEL                                   4U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D4_PIN_NAME                         GPIO_EMC_04   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D4_LABEL                              "SEMC_D4"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D4_NAME                               "SEMC_D4"   /*!< Identifier */

