jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_EMC_05 (coord G5), SEMC_D5 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D5_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D5_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D5_CHANNEL                                   5U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D5_PIN_NAME                         GPIO_EMC_05   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D5_LABEL                              "SEMC_D5"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D5_NAME                               "SEMC_D5"   /*!< Identifier */

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D6_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D6_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D6_CHANNEL                                   6U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D6_PIN_NAME                         GPIO_EMC_06   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D6_LABEL                              "SEMC_D6"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D6_NAME                               "SEMC_D6"   /*!< Identifier */

/* GPIO_EMC_07 (coord H4), SEMC_D7 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D7_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D7_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D7_CHANNEL                                   7U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D7_PIN_NAME                         GPIO_EMC_07   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D7_LABEL                              "SEMC_D7"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D7_NAME                               "SEMC_D7"   /*!< Identifier */

/* GPIO_EMC_30 (coord C6), SEMC_D8 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D8_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D8_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D8_CHANNEL                                   8U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D8_PIN_NAME                         GPIO_EMC_30   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D8_LABEL                              "SEMC_D8"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D8_NAME                               "SEMC_D8"   /*!< Identifier */

/* GPIO_EMC_31 (coord C5), SEMC_D9 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D9_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D9_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D9_CHANNEL                                   9U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D9_PIN_NAME                         GPIO_EMC_31   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D9_LABEL                              "SEMC_D9"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D9_NAME                               "SEMC_D9"   /*!< Identifier */

/* GPIO_EMC_32 (coord D5), SEMC_D10 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D10_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D10_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D10_CHANNEL                                 10U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D10_PIN_NAME                        GPIO_EMC_32   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D10_LABEL                            "SEMC_D10"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D10_NAME                             "SEMC_D10"   /*!< Identifier */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D11_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D11_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D11_CHANNEL                                 11U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D11_PIN_NAME                        GPIO_EMC_33   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D11_LABEL                            "SEMC_D11"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D11_NAME                             "SEMC_D11"   /*!< Identifier */

/* GPIO_EMC_34 (coord D4), SEMC_D12 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D12_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D12_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D12_CHANNEL                                 12U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D12_PIN_NAME                        GPIO_EMC_34   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D12_LABEL                            "SEMC_D12"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D12_NAME                             "SEMC_D12"   /*!< Identifier */

/* GPIO_EMC_35 (coord E5), SEMC_D13 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D13_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D13_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D13_CHANNEL                                 13U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D13_PIN_NAME                        GPIO_EMC_35   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D13_LABEL                            "SEMC_D13"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D13_NAME                             "SEMC_D13"   /*!< Identifier */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D14_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D14_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D14_CHANNEL                                 14U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D14_PIN_NAME                        GPIO_EMC_36   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D14_LABEL                            "SEMC_D14"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D14_NAME                             "SEMC_D14"   /*!< Identifier */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D15_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D15_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D15_CHANNEL                                 15U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_D15_PIN_NAME                        GPIO_EMC_37   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_D15_LABEL                            "SEMC_D15"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D15_NAME                             "SEMC_D15"   /*!< Identifier */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_SIGNAL                                   DM   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_CHANNEL                                  0U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PIN_NAME                        GPIO_EMC_08   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_LABEL                            "SEMC_DM0"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DM0_NAME                             "SEMC_DM0"   /*!< Identifier */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_SIGNAL                                   DM   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_CHANNEL                                  1U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PIN_NAME                        GPIO_EMC_38   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_LABEL                            "SEMC_DM1"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DM1_NAME                             "SEMC_DM1"   /*!< Identifier */

