jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_EMC_25 (coord D2), SEMC_RAS */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_SIGNAL                             semc_ras   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PIN_NAME                        GPIO_EMC_25   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_LABEL                            "SEMC_RAS"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_RAS_NAME                             "SEMC_RAS"   /*!< Identifier */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_WE_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_WE_SIGNAL                               semc_we   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_WE_PIN_NAME                         GPIO_EMC_28   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_SEMC_WE_LABEL                              "SEMC_WE"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_WE_NAME                               "SEMC_WE"   /*!< Identifier */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_ENET_MDIO_PERIPHERAL                            SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_ENET_MDIO_SIGNAL                                 CSX   /*!< Signal name */
#define BOARD_INITSDRAMPINS_ENET_MDIO_CHANNEL                                 0U   /*!< Signal channel */
#define BOARD_INITSDRAMPINS_ENET_MDIO_PIN_NAME                       GPIO_EMC_41   /*!< Routed pin name */
#define BOARD_INITSDRAMPINS_ENET_MDIO_LABEL                          "ENET_MDIO"   /*!< Label */
#define BOARD_INITSDRAMPINS_ENET_MDIO_NAME                           "ENET_MDIO"   /*!< Identifier */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);

/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D9_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D9_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D9_CHANNEL                                      9U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D9_PIN_NAME                          GPIO_AD_B1_08   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D9_LABEL          "AUD_INT/CSI_D9//J35[13]/J22[4]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D9_NAME                                   "CSI_D9"   /*!< Identifier */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/CSI_D8/J35[11] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D8_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D8_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D8_CHANNEL                                      8U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D8_PIN_NAME                          GPIO_AD_B1_09   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D8_LABEL                "SAI1_MCLK/CSI_D8/J35[11]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D8_NAME                                   "CSI_D8"   /*!< Identifier */

/* GPIO_AD_B1_10 (coord L13), SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D7_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D7_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D7_CHANNEL                                      7U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D7_PIN_NAME                          GPIO_AD_B1_10   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D7_LABEL       "SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D7_NAME                                   "CSI_D7"   /*!< Identifier */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D6_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D6_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D6_CHANNEL                                      6U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D6_PIN_NAME                          GPIO_AD_B1_11   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D6_LABEL       "SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D6_NAME                                   "CSI_D6"   /*!< Identifier */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/CSI_D5/J35[5]/U13[16] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D5_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D5_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D5_CHANNEL                                      5U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D5_PIN_NAME                          GPIO_AD_B1_12   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D5_LABEL          "SAI1_RXD/CSI_D5/J35[5]/U13[16]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D5_NAME                                   "CSI_D5"   /*!< Identifier */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/CSI_D4/J35[3]/U13[14] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D4_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D4_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D4_CHANNEL                                      4U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D4_PIN_NAME                          GPIO_AD_B1_13   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D4_LABEL          "SAI1_TXD/CSI_D4/J35[3]/U13[14]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D4_NAME                                   "CSI_D4"   /*!< Identifier */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D2_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D2_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D2_CHANNEL                                      2U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D2_PIN_NAME                          GPIO_AD_B1_15   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D2_LABEL      "SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D2_NAME                                   "CSI_D2"   /*!< Identifier */

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_D3_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_D3_SIGNAL                                 csi_data   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_D3_CHANNEL                                      3U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_D3_PIN_NAME                          GPIO_AD_B1_14   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_D3_LABEL      "SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D3_NAME                                   "CSI_D3"   /*!< Identifier */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J35[8]/J23[3] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_PIXCLK_PERIPHERAL                              CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_PIXCLK_SIGNAL                           csi_pixclk   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_PIXCLK_PIN_NAME                      GPIO_AD_B1_04   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_PIXCLK_LABEL            "CSI_PIXCLK/J35[8]/J23[3]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_PIXCLK_NAME                           "CSI_PIXCLK"   /*!< Identifier */

/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J35[12]/J23[4] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_MCLK_PERIPHERAL                                CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_MCLK_SIGNAL                               csi_mclk   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_MCLK_PIN_NAME                        GPIO_AD_B1_05   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_MCLK_LABEL               "CSI_MCLK/J35[12]/J23[4]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_MCLK_NAME                               "CSI_MCLK"   /*!< Identifier */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_VSYNC_PERIPHERAL                               CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_VSYNC_SIGNAL                             csi_vsync   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_VSYNC_PIN_NAME                       GPIO_AD_B1_06   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_VSYNC_LABEL     "CSI_VSYNC/J35[18]/J22[2]/UART_TX"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_VSYNC_NAME                             "CSI_VSYNC"   /*!< Identifier */

