jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_HSYNC_PERIPHERAL                               CSI   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_HSYNC_SIGNAL                             csi_hsync   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_HSYNC_PIN_NAME                       GPIO_AD_B1_07   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_HSYNC_LABEL     "CSI_HSYNC/J35[16]/J22[1]/UART_RX"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_HSYNC_NAME                             "CSI_HSYNC"   /*!< Identifier */

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_PERIPHERAL                          LPI2C1   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_SIGNAL                                 SCL   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_PIN_NAME                     GPIO_AD_B1_00   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_LABEL "I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4]" /*!< Label */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_NAME                         "CSI_I2C_SCL"   /*!< Identifier */

/* GPIO_AD_B1_01 (coord K11), I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_PERIPHERAL                          LPI2C1   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_SIGNAL                                 SDA   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_PIN_NAME                     GPIO_AD_B1_01   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_LABEL "I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6]" /*!< Label */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_NAME                         "CSI_I2C_SDA"   /*!< Identifier */

/* GPIO_AD_B0_04 (coord F11), CSI_PWDN/J35[17]/BOOT_MODE[0] */
/* Routed pin properties */
#define BOARD_INITCSIPINS_CSI_PWDN_PERIPHERAL                              GPIO1   /*!< Peripheral name */
#define BOARD_INITCSIPINS_CSI_PWDN_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITCSIPINS_CSI_PWDN_CHANNEL                                    4U   /*!< Signal channel */
#define BOARD_INITCSIPINS_CSI_PWDN_PIN_NAME                        GPIO_AD_B0_04   /*!< Routed pin name */
#define BOARD_INITCSIPINS_CSI_PWDN_LABEL         "CSI_PWDN/J35[17]/BOOT_MODE[0]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_PWDN_NAME                               "CSI_PWDN"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCSIPINS_CSI_PWDN_GPIO                                    GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSIPINS_CSI_PWDN_GPIO_PIN                                   4U   /*!< GPIO pin number */
#define BOARD_INITCSIPINS_CSI_PWDN_GPIO_PIN_MASK                      (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITCSIPINS_CSI_PWDN_PORT                                    GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITCSIPINS_CSI_PWDN_PIN                                        4U   /*!< PORT pin number */
#define BOARD_INITCSIPINS_CSI_PWDN_PIN_MASK                           (1U << 4U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCSIPins(void);

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D0_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D0_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D0_CHANNEL                                    0U   /*!< Signal channel */
#define BOARD_INITLCDPINS_LCDIF_D0_PIN_NAME                           GPIO_B0_04   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_D0_LABEL                    "LCDIF_D0/BT_CFG[0]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D0_NAME                               "LCDIF_D0"   /*!< Identifier */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D1_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D1_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D1_CHANNEL                                    1U   /*!< Signal channel */
#define BOARD_INITLCDPINS_LCDIF_D1_PIN_NAME                           GPIO_B0_05   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_D1_LABEL                    "LCDIF_D1/BT_CFG[1]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D1_NAME                               "LCDIF_D1"   /*!< Identifier */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D2_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D2_SIGNAL                             lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D2_CHANNEL                                    2U   /*!< Signal channel */
#define BOARD_INITLCDPINS_LCDIF_D2_PIN_NAME                           GPIO_B0_06   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_D2_LABEL                    "LCDIF_D2/BT_CFG[2]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D2_NAME                               "LCDIF_D2"   /*!< Identifier */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_CLK_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_CLK_SIGNAL                             lcdif_clk   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_CLK_PIN_NAME                          GPIO_B0_00   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_CLK_LABEL                            "LCDIF_CLK"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_CLK_NAME                             "LCDIF_CLK"   /*!< Identifier */

