jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D13_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D13_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D13_CHANNEL                                  13U   /*!< Signal channel */
#define BOARD_INITLCDPINS_LCDIF_D13_PIN_NAME                          GPIO_B1_01   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_D13_LABEL                            "LCDIF_D13"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D13_NAME                             "LCDIF_D13"   /*!< Identifier */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D14_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D14_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D14_CHANNEL                                  14U   /*!< Signal channel */
#define BOARD_INITLCDPINS_LCDIF_D14_PIN_NAME                          GPIO_B1_02   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_D14_LABEL                            "LCDIF_D14"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D14_NAME                             "LCDIF_D14"   /*!< Identifier */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_D15_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_D15_SIGNAL                            lcdif_data   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_D15_CHANNEL                                  15U   /*!< Signal channel */
#define BOARD_INITLCDPINS_LCDIF_D15_PIN_NAME                          GPIO_B1_03   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_D15_LABEL                            "LCDIF_D15"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D15_NAME                             "LCDIF_D15"   /*!< Identifier */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_PERIPHERAL                          LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_SIGNAL                       lcdif_enable   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_PIN_NAME                       GPIO_B0_01   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_LABEL                      "LCDIF_ENABLE"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_NAME                       "LCDIF_ENABLE"   /*!< Identifier */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_PERIPHERAL                           LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_SIGNAL                         lcdif_hsync   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_PIN_NAME                        GPIO_B0_02   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_LABEL                        "LCDIF_HSYNC"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_NAME                         "LCDIF_HSYNC"   /*!< Identifier */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
/* Routed pin properties */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_PERIPHERAL                           LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_SIGNAL                         lcdif_vsync   /*!< Signal name */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_PIN_NAME                        GPIO_B0_03   /*!< Routed pin name */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_LABEL                        "LCDIF_VSYNC"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_NAME                         "LCDIF_VSYNC"   /*!< Identifier */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
/* Routed pin properties */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PERIPHERAL                         GPIO2   /*!< Peripheral name */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_CHANNEL                              31U   /*!< Signal channel */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PIN_NAME                      GPIO_B1_15   /*!< Routed pin name */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_LABEL       "USB_HOST_PWR/BACKLIGHT_CTL"   /*!< Label */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_NAME                     "BACKLIGHT_CTL"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_GPIO                               GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_GPIO_PIN                             31U   /*!< GPIO pin number */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_GPIO_PIN_MASK                (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PORT                               GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PIN                                  31U   /*!< PORT pin number */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PIN_MASK                     (1U << 31U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN2_TX_PERIPHERAL                                CAN2   /*!< Peripheral name */
#define BOARD_INITCANPINS_CAN2_TX_SIGNAL                                      TX   /*!< Signal name */
#define BOARD_INITCANPINS_CAN2_TX_PIN_NAME                         GPIO_AD_B0_14   /*!< Routed pin name */
#define BOARD_INITCANPINS_CAN2_TX_LABEL                         "CAN2_TX/U12[1]"   /*!< Label */
#define BOARD_INITCANPINS_CAN2_TX_NAME                                 "CAN2_TX"   /*!< Identifier */

/* GPIO_AD_B0_15 (coord L10), CAN2_RX/U12[4] */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN2_RX_PERIPHERAL                                CAN2   /*!< Peripheral name */
#define BOARD_INITCANPINS_CAN2_RX_SIGNAL                                      RX   /*!< Signal name */
#define BOARD_INITCANPINS_CAN2_RX_PIN_NAME                         GPIO_AD_B0_15   /*!< Routed pin name */
#define BOARD_INITCANPINS_CAN2_RX_LABEL                         "CAN2_RX/U12[4]"   /*!< Label */
#define BOARD_INITCANPINS_CAN2_RX_NAME                                 "CAN2_RX"   /*!< Identifier */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);

/* GPIO_EMC_40 (coord A7), ENET_MDC */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME                         GPIO_EMC_40   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL                             "ENET_MDC"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME                              "ENET_MDC"   /*!< Identifier */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME                        GPIO_EMC_41   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL                           "ENET_MDIO"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME                            "ENET_MDIO"   /*!< Identifier */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TX_CLK_PERIPHERAL                           ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TX_CLK_SIGNAL                       enet_ref_clk   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TX_CLK_PIN_NAME                       GPIO_B1_10   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TX_CLK_LABEL                       "ENET_TX_CLK"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_CLK_NAME                        "ENET_TX_CLK"   /*!< Identifier */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL                         enet_rx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL                                  0U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_NAME                         GPIO_B1_04   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_RXD0_LABEL                           "ENET_RXD0"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD0_NAME                            "ENET_RXD0"   /*!< Identifier */

