jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_B1_05 (coord D12), ENET_RXD1 */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL                         enet_rx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL                                  1U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_RXD1_PIN_NAME                         GPIO_B1_05   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_RXD1_LABEL                           "ENET_RXD1"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD1_NAME                            "ENET_RXD1"   /*!< Identifier */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_CRS_DV_PERIPHERAL                           ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_CRS_DV_SIGNAL                         enet_rx_en   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN_NAME                       GPIO_B1_06   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_CRS_DV_LABEL                       "ENET_CRS_DV"   /*!< Label */
#define BOARD_INITENETPINS_ENET_CRS_DV_NAME                        "ENET_CRS_DV"   /*!< Identifier */

/* GPIO_B1_11 (coord C13), ENET_RXER */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXER_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXER_SIGNAL                           enet_rx_er   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXER_PIN_NAME                         GPIO_B1_11   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_RXER_LABEL                           "ENET_RXER"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXER_NAME                            "ENET_RXER"   /*!< Identifier */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL                         enet_tx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL                                  0U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_TXD0_PIN_NAME                         GPIO_B1_07   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TXD0_LABEL                           "ENET_TXD0"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXD0_NAME                            "ENET_TXD0"   /*!< Identifier */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL                         enet_tx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL                                  1U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_TXD1_PIN_NAME                         GPIO_B1_08   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TXD1_LABEL                           "ENET_TXD1"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXD1_NAME                            "ENET_TXD1"   /*!< Identifier */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXEN_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXEN_SIGNAL                           enet_tx_en   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXEN_PIN_NAME                         GPIO_B1_09   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TXEN_LABEL                           "ENET_TXEN"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXEN_NAME                            "ENET_TXEN"   /*!< Identifier */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void);

/* GPIO_SD_B0_05 (coord J2), SD1_D3 */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D3_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D3_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D3_CHANNEL                                    3U   /*!< Signal channel */
#define BOARD_INITUSDHCPINS_SD1_D3_PIN_NAME                        GPIO_SD_B0_05   /*!< Routed pin name */
#define BOARD_INITUSDHCPINS_SD1_D3_LABEL                                "SD1_D3"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_D3_NAME                                 "SD1_D3"   /*!< Identifier */

/* GPIO_SD_B0_04 (coord H2), SD1_D2 */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D2_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D2_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D2_CHANNEL                                    2U   /*!< Signal channel */
#define BOARD_INITUSDHCPINS_SD1_D2_PIN_NAME                        GPIO_SD_B0_04   /*!< Routed pin name */
#define BOARD_INITUSDHCPINS_SD1_D2_LABEL                                "SD1_D2"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_D2_NAME                                 "SD1_D2"   /*!< Identifier */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J24[5]/SPI_MISO */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D1_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D1_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D1_CHANNEL                                    1U   /*!< Signal channel */
#define BOARD_INITUSDHCPINS_SD1_D1_PIN_NAME                        GPIO_SD_B0_03   /*!< Routed pin name */
#define BOARD_INITUSDHCPINS_SD1_D1_LABEL                "SD1_D1/J24[5]/SPI_MISO"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_D1_NAME                                 "SD1_D1"   /*!< Identifier */

