jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_D0_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_D0_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_D0_CHANNEL                                    0U   /*!< Signal channel */
#define BOARD_INITUSDHCPINS_SD1_D0_PIN_NAME                        GPIO_SD_B0_02   /*!< Routed pin name */
#define BOARD_INITUSDHCPINS_SD1_D0_LABEL            "SD1_D0/J24[4]/SPI_MOSI/PWM"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_D0_NAME                                 "SD1_D0"   /*!< Identifier */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CMD_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CMD_SIGNAL                             usdhc_cmd   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_CMD_PIN_NAME                       GPIO_SD_B0_00   /*!< Routed pin name */
#define BOARD_INITUSDHCPINS_SD1_CMD_LABEL                       "SD1_CMD/J24[6]"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_CMD_NAME                               "SD1_CMD"   /*!< Identifier */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CLK_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CLK_SIGNAL                             usdhc_clk   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_CLK_PIN_NAME                       GPIO_SD_B0_01   /*!< Routed pin name */
#define BOARD_INITUSDHCPINS_SD1_CLK_LABEL                       "SD1_CLK/J24[3]"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_CLK_NAME                               "SD1_CLK"   /*!< Identifier */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_PERIPHERAL                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_SIGNAL               FLEXSPI_A_SCLK   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_PIN_NAME              GPIO_SD_B1_07   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_LABEL                 "FlexSPI_CLK"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_NAME                  "FlexSPI_CLK"   /*!< Identifier */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_A_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_A_SIGNAL             FLEXSPI_A_DATA2   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_A_PIN_NAME             GPIO_SD_B1_10   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_A_LABEL               "FlexSPI_D2_A"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_A_NAME                "FlexSPI_D2_A"   /*!< Identifier */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_A_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_A_SIGNAL             FLEXSPI_A_DATA0   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_A_PIN_NAME             GPIO_SD_B1_08   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_A_LABEL               "FlexSPI_D0_A"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_A_NAME                "FlexSPI_D0_A"   /*!< Identifier */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_A_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_A_SIGNAL             FLEXSPI_A_DATA1   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_A_PIN_NAME             GPIO_SD_B1_09   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_A_LABEL               "FlexSPI_D1_A"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_A_NAME                "FlexSPI_D1_A"   /*!< Identifier */

/* GPIO_SD_B1_00 (coord L5), FlexSPI_D3_B */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_B_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_B_SIGNAL             FLEXSPI_B_DATA3   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_B_PIN_NAME             GPIO_SD_B1_00   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_B_LABEL               "FlexSPI_D3_B"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_B_NAME                "FlexSPI_D3_B"   /*!< Identifier */

/* GPIO_SD_B1_01 (coord M5), FlexSPI_D2_B */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_B_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_B_SIGNAL             FLEXSPI_B_DATA2   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_B_PIN_NAME             GPIO_SD_B1_01   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_B_LABEL               "FlexSPI_D2_B"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D2_B_NAME                "FlexSPI_D2_B"   /*!< Identifier */

/* GPIO_SD_B1_02 (coord M3), FlexSPI_D1_B */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_B_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_B_SIGNAL             FLEXSPI_B_DATA1   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_B_PIN_NAME             GPIO_SD_B1_02   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_B_LABEL               "FlexSPI_D1_B"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D1_B_NAME                "FlexSPI_D1_B"   /*!< Identifier */

/* GPIO_SD_B1_03 (coord M4), FlexSPI_D0_B */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_B_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_B_SIGNAL             FLEXSPI_B_DATA0   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_B_PIN_NAME             GPIO_SD_B1_03   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_B_LABEL               "FlexSPI_D0_B"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D0_B_NAME                "FlexSPI_D0_B"   /*!< Identifier */

