jvmreis/nxp_interrupt_lesson/board/pin_mux.h
/* GPIO_SD_B1_04 (coord P2), FlexSPI_CLK_B */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_PERIPHERAL                FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_SIGNAL             FLEXSPI_B_SCLK   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_PIN_NAME            GPIO_SD_B1_04   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_LABEL             "FlexSPI_CLK_B"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_NAME              "FlexSPI_CLK_B"   /*!< Identifier */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_PERIPHERAL                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_SIGNAL              FLEXSPI_A_SS0_B   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_PIN_NAME              GPIO_SD_B1_06   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_LABEL                 "FlexSPI_SS0"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_NAME                  "FlexSPI_SS0"   /*!< Identifier */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_PERIPHERAL                 FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_SIGNAL             FLEXSPI_A_DATA3   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_PIN_NAME             GPIO_SD_B1_11   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_LABEL               "FlexSPI_D3_A"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_NAME                "FlexSPI_D3_A"   /*!< Identifier */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS */
/* Routed pin properties */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_PERIPHERAL                  FLEXSPI   /*!< Peripheral name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_SIGNAL                FLEXSPI_A_DQS   /*!< Signal name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_PIN_NAME              GPIO_SD_B1_05   /*!< Routed pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_LABEL                 "FlexSPI_DQS"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_NAME                  "FlexSPI_DQS"   /*!< Identifier */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitHyperFlashPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
